CSI API ETABS v1

# cDStAustralian_AS4100_98 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStAustralian_AS4100_98

    Public Interface cDStAustralian_AS4100_98

    Dim instance As cDStAustralian_AS4100_98

    public interface class cDStAustralian_AS4100_98

    type cDStAustralian_AS4100_98 =  interface end

The cDStAustralian_AS4100_98 type exposes the following members.

Methods

| Name| Description
---|---|---
| [GetOverwrite](b44a47fa-82dd-
bd5a-5903-0ff6ff66129d.htm)|  Retrieves the value of a steel design overwrite
item
|
GetPreference|  Retrieves the
value of a steel design preference item
|
SetOverwrite|  Sets the value of a
steel design overwrite item
|
SetPreference|  Sets the value of
a steel design preference item
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com